"""
Регулярные выражения для валидации полей
"""

PATTERNS = [
    r'^\+7-\(\d{3}\)-\d{3}-\d{2}-\d{2}$',   #telephone
    r'^(1\.[0-9]{2}|2\.[0-4][0-9]|2\.50)$',  #height
    r'^\d{10,12}$',     #inn
    r'^\d{2}-\d{2}/\d{2}$',     #identifier
    r'^[A-Za-zА-Яа-яЁё\s\-]+$', #occupation
    r'^-?(?:90(?:\.0+)?|[1-8]?\d(?:\.\d+)?)$', #lattitude
    r'^(O|A|B|AB)[+−]$',    #blood_type
    r'^\d{4}-\d{4}$',     #issn
    r'^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$',   #uuid
    r'^\d{4}-(0[1-9]|1[0-2])-(0[1-9]|[12]\d|3[01])$'     #date
]
